# Terminals
cask 'iterm2'
brew 'tmux'

# Repo
brew 'repo'

# Shells
brew 'zsh'

# Kubernetes
brew 'kube-ps1'
brew 'kubernetes-cli'

# Editors
cask 'sublime-text'

# Download
brew 'curl'
brew 'wget'

# Version control
brew 'git'

# https://www.topbug.net/blog/2013/04/14/install-and-use-gnu-command-line-tools-in-mac-os-x/
# Basic file, shell and text manipulation utilities of the GNU operating system.
brew 'coreutils'

brew 'binutils'
brew 'diffutils'
brew 'ed'
brew 'findutils'
brew 'gawk'
brew 'gnu-indent'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gnu-which'
brew 'gnutls'
brew 'gzip'
brew 'watch'
brew 'wdiff'

##
# Some GNU command line tools already exist by default on OS X.
# We choose to replace these with newer versions.
##

brew 'gdb'  # gdb requires further actions to make it work. See `brew info gdb`.
brew 'gpatch'
brew 'less'
brew 'm4'
brew 'make'
brew 'nano'


# File compression/uncompression
brew 'zstd'
brew 'unrar'
brew 'unzip'

# file synchronizer.
brew 'rsync'

# Text search
brew 'grep'
brew 'jq'

# Docker software containers to help distribute applications.
#brew 'docker'
#brew 'docker-machine'
#brew 'xhyve'
#brew 'docker-machine-driver-xhyve'
#cask 'osxfuse'
#brew 'sshfs'


## Programming 
tap 'codeclimate/formulae'
brew 'codeclimate'

## Uncategorized
brew 'base64'
#cask 'spotify'
#cask 'java'
cask 'java8'
brew 'jenv'
brew 'go'
brew 'gradle'
brew 'maven'
brew 'python'
brew 'python3'
cask 'intellij-idea'
brew 'ansible'
cask 'slack'
cask 'minikube'	
brew 'kubectl'
brew 'glide'
brew 'kubectx' 
tap 'boz/repo'
brew 'boz/repo/kail'
brew 'kubernetes-helm'
brew 'dep'
brew 'terraform'
brew 'azure-cli'